1
1 10
10 10
2
2 10
3
3 10
4
4 10
7
7 10
8
8 10
80's
9
9 10
able
absurd
accent
according
acting
action
actor
actors
actually
adds
affair
ages
alice
along
already
alright
also
although
always
amateurish
amazing
american
among
animal
animated
anime
annoyed
annoying
another
anything
appalling
apparently
appeared
appears
appreciate
appreciated
around
ashamed
asian
asleep
atmosphere
atrocious
attempt
attention
audience
australian
available
avoid
award
awesome
awful
b movie
back
bad
bad guy
bad guys
bad movie
bad thing
badly
baldwin
barely
basically
batman
battle
beautiful
beautifully
beauty
become
beginning
beginning end
believable
believe
best
best part
better
betty
bible
bill
bit
blah
blame
bland
blonde
blood
body
boll
bond
book
books
bore
bored
boredom
boring
bother
bothered
bourne
box
boy
boys
br br want
br want
bravo
brazil
brilliant
brilliantly
brings
brought
brutal
bugs
bunch
buy
called
camera
can't
can't wait
captures
car
cardboard
care
carries
cartoons
castle
caught
certain
certainly
chance
change
channel
characters
charming
chase
cheap
cheesy
child
chilling
christian
christmas
church
cinema
city
classic
cliché
clichéd
clichés
closer
clothes
collection
comedies
comedy
comic
coming
comment
compelling
complaint
complete
completely
complex
concept
confusing
contrived
cool
copy
could
couple
courage
course
cover
crafted
crap
crappy
crazy
credibility
cried
crime
criminal
cry
current
dark
daughter
david
day
days
deal
deals
dear
death
decent
deeper
definitely
definitely worth
delightful
delivers
deserves
dialog
dialogue
different
dimensional
dire
direction
director
directors
dirty
dirty harry
disappointed
disappointing
disappointment
disaster
disgusting
disjointed
documentary
dollar
downhill
dreadful
dream
dreams
drivel
dull
dumb
dvd
easily
eastwood
easy
ed
edge
edie
editing
eerie
effective
effects
effort
either
else
elvis
embarrassed
embarrassing
emotional
emotions
end
ended
ending
endless
english
enjoy
enjoyable
enjoyed
enough
entertaining
entertainment
entire
episode
episodes
era
especially
etc
europe
even
even better
even though
events
ever
everyday
everyone
everything
example
excellent
except
exception
exceptional
exciting
excuse
expect
expecting
experience
explained
extraordinary
eye
eyes
f
facts
failed
fails
failure
fake
falls
familiar
family
fantastic
far
fascinating
fast forward
favorite
favorites
favourite
fears
feel
felix
felt
felt like
female
festival
fill
filmmakers
films
find
finds
fine
finest
first
first movie
first rate
first saw
first time
flat
flawless
flick
follows
footage
forced
forget
forgettable
forward
found
frank
frankly
freedom
french
fresh
friend
friendship
fulci
fun
funniest
funny
future
game
gandhi
garbage
gave
gay
gem
generous
genius
genre
genuine
genuinely
george
german
germany
ghost
giant
give
given
gives
glad
god
goes
good
good movie
gore
gorgeous
government
grade
grave
great
great film
great job
great movie
greatest
gripping
gritty
group
guess
gun
guy
ha
half
happen
happiness
happy
hardly
harry
hated
haunting
heart
hell
helps
hepburn
highly
highly recommend
highly recommended
hilarious
history
hit
hitchcock
hitler
holly
holmes
home
honestly
hong kong
hooked
hope
hoping
horrible
hour
house
however
human
humanity
humor
hype
i'm
i'm afraid
idea
ill
images
impact
important
impressed
impressive
incoherent
incredible
information
innocent
inside
instead
insult
intelligent
intense
interest
interesting
international
irritating
jack
jackass
jackie
jean
jesus
job
john
joke
jones
journey
joy
jungle
junk
keep
keeps
kelly
kill
killed
killer
kitty
know
knowing
knows
kung fu
lack
lacked
lacking
lacks
lame
last
late
later
laughable
laughing
lazy
least
lee
left
length
less
let's
life
light
liked
liked movie
linda
line
liners
lines
lion
little
little film
lives
living
look like
looked
looking
looking forward
looks
looks like
lot
louis
lousy
love
love movie
loved
loved movie
lovely
low
ludicrous
lugosi
machine
made
made sense
magic
magnificent
main
make
make movie
makers
makes
making
male
man
manages
many
marie
marvelous
mason
master
masterpiece
match
material
matter
matthau
may
maybe
mean
mediocre
meets
memorable
men
mess
message
might
mildly
mind
minor
minutes
miscast
miss
missed
missing
mistake
modern
money
monkey
monster
moved
movie well
moving
ms
mst3k
much
much better
mummy
murder
music
must see
mystery science
nature
necessary
needed
neither
never
nevertheless
new
nice
nicely
nobody
noir
none
nonetheless
nonsense
norris
nothing
noticed
novels
nowhere
nudity
obnoxious
obvious
obviously
offensive
often
oh
ok
okay
old
olds
one best
one better
one good
one worst
original
oscar
others
otherwise
outstanding
overall
pace
page
paid
painful
paint
paper
par
parker
part movie
parts
pass
past
pathetic
patient
paul
people
perfect
perfectly
performance
performances
personal
piece
played
plays
pleasant
pleasantly
pleasantly surprised
please
pleased
pleasure
plenty
plot
point
pointless
police
poor
poorly
porn
portrayal
positive
potential
power
powerful
predictable
premise
present
pretentious
pretty
pretty good
prince
problem
problems
producers
project
promise
promising
proof
propaganda
provides
provoking
quiet
quite
random
rare
raw
read
read book
real
realistic
reality
really good
reason
recently
recommend
recommended
redeeming
refreshing
relate
relationship
release
released
remake
remarkable
remember
remembered
reminds
remotely
rent
rented
repetitive
research
rest
result
return
revenge
ride
ridiculous
right
rip
rock
roles
romantic
rubbish
ruined
rules
run
running
ryan
sad
sadly
said
sake
satisfying
save
saving
saw
saw movie
saying
scared
scenes
scientist
score
screaming
screen
screenplay
screenwriter
script
seagal
season
seat
seconds
see
seemed
seems
seen
sees
segal
sensitive
sequel
sequence
series
several
sex
shallow
shame
share
sharp
shelf
shoot
short
shots
showed
shown
shows
sick
silly
similar
simple
simply
sinatra
sister
sisters
sit
sit back
sitting
situation
skip
sleep
slow
small
soap
soccer
society
solid
someone
something
sometimes
somewhat
song
soon
sorry
sort
soundtrack
soviet
space
spectacular
spent
stands
stanwyck
started
starts
state
stay
stay away
steals
stereotypes
stewart
stick
still
stilted
stinker
stock
story
storyline
strong
stunning
stupid
stupidity
subtitles
subtle
succeeds
success
sucked
sucks
superb
superbly
suppose
supposed
supposedly
surprise
surprised
surprising
surprisingly
survive
suspense
sweet
system
takes
tale
tarzan
tears
tedious
tells
terrible
terrific
thank
thanks
theme
themes
there's
they're
thin
thing
things
think
thinking
though
thought
thought provoking
thriller
throughout
thrown
tight
time
times
tired
tiresome
today
today's
todd
together
tony
top
top notch
total
touch
touches
touching
traditional
tragic
train
trash
treat
tree
tried
tries
trip
tripe
trite
troubled
true
truly
truth
trying
turkey
turned
turns
tv
twists
two hours
ugly
ultimate
unbelievable
unconvincing
underrated
unexpected
unforgettable
unfortunately
unfunny
uninspired
unintentionally
uninteresting
unique
unless
unlike
unnecessary
unrealistic
unusual
unwatchable
urban
us
use
useless
utter
value
van
vanessa
vhs
victims
viewing
wait
walk
walked
want
want see
wanted
wanted like
war
warm
waste
waste time
wasted
wasting
watch
watchable
watching
wax
way
ways
weak
wearing
well
well done
well worth
well written
went
werewolf
west
whatsoever
whole
whole film
whole movie
witty
woman
women
wonder
wonderful
wonderfully
wood
wooden
works
world
worse
worst
worth
worth seeing
would
would like
would've
write
writers
writing
wrong
wrote
yawn
year old
years
yet
young
zombie
zombies
